<?php

return [
    'verify' => 'Подтвердите электронный адрес',
    'fresh_link' => 'На ваш адрес электронной почты была отправлена новая ссылка для подтверждения.',
    'check_email' => 'Прежде чем продолжить, проверьте свою электронную почту на наличие ссылки для подтверждения.',
    'did_not_receive' => 'Если вы не получили письмо',
    'click_here' => 'нажмите здесь, чтобы запросить новое',
    'reset_password' => 'Сбросить пароль',
    'reset_password_notification' => 'Сброс пароля',
    'reset_password_greetings' => 'Вы получили это письмо, потому что мы получили запрос на сброс пароля для вашей учетной записи.',
    'reset_password_expire_in' => 'Срок действия ссылки для сброса пароля истекает через :count мин.',
    'reset_password_not_request' => 'Если вы не запрашивали сброс пароля, никаких дальнейших действий не требуется.',
    'verify_email' => 'Подтверждение адреса электронной почты',
    'verify_email_greetings' => 'Пожалуйста, нажмите кнопку ниже, чтобы подтвердить свой адрес электронной почты.',
    'verify_email_button' => 'Подтвердить электронную почту',
    'verify_email_not_request' => 'Если вы не создавали учетную запись, никаких дальнейших действий не требуется.',
    'whoops' => 'Ууупс!',
    'hello' => 'Приветствуем!',
    'regards' => 'С уважением',
    'team' => 'команда',
    'problems' => "Если у вас возникли проблемы с кнопкой \":actionText\", скопируйте и вставьте URL-адрес,\nуказанный ниже, в свой веб-браузер: [:actionURL](:actionURL)",
];
