<template>
    <div>
        <div class="main-products-content">
            <img :src="MainProductsBgSecond"
                 class="main-products-bg-second wow fadeIn" data-wow-duration="2s">
            <div class="container">
                <div class="main-product-info wow fadeInRight" data-wow-duration="2s">
                    <div
                        v-for="solution of solutions"
                        :class="'main-product-item main-product-item-' + solution.id"
                    >
                        <div class="row main-product-item-content">
                            <div class="col-md-6">
                                <img
                                    :src="solution.img"
                                    class="main-products-bg fadeIn" data-wow-duration="2s"
                                    :class="wowClass(solution.id)"
                                >
                            </div>
                            <div class="col-md-6 main-product-item-content-txt">
                                <p class="main-product-small-title">Готовые решения</p>
                                <h3 class="main-product-title"> {{ solution.title }}</h3>
                                <div class="main-product-line"></div>
                                <p class="main-product-text" v-html="solution.text"></p>
                                <span class="main-button-link">
                                    <a
                                        href=""
                                        @click.prevent="showDetails(solution)"
                                    >
                                        Подробнее
                                    </a>
                                </span>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div class="modal fade" id="productDetails" tabindex="-1" role="dialog" aria-labelledby="productDetailsTitle"
             aria-hidden="true">
            <div class="modal-dialog modal-dialog-centered" role="document">
                <div class="modal-content rounded-0 shadow-lg" style="border: 0;">
                    <div class="modal-header">
                        <h5 class="modal-title text-left" id="productDetailsTitle">{{ detailsWindow.title }}</h5>
                        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                            <span aria-hidden="true">&times;</span>
                        </button>
                    </div>
                    <div class="modal-body text-left" v-html="detailsWindow.text"></div>
                    <div class="modal-body text-left" v-html="detailsWindow.details"></div>
                    <div class="modal-footer">
                        <button type="button" class="btn btn-secondary" data-dismiss="modal">Закрыть</button>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    import MainProductsBgSecond from '../../../../public/img/templates/main-products/main-products-bg-second.png'
    import GosStruktury from '../../../../public/img/templates/main-products/gos_struktury.jpg'
    import ObrazovatelnyeUchrezhdenia
        from '../../../../public/img/templates/main-products/obrazovatelnye-uchrezhdenia.jpg'
    import ZhilyeKomplexy from '../../../../public/img/templates/main-products/zhilye-komplexy.jpg'
    import RoznichnayaTorgovlya from '../../../../public/img/templates/main-products/roznichnaya-torgovlya.jpg'
    import TransportILogikistika from '../../../../public/img/templates/main-products/transport-i-logikistika.jpg'
    import Zavod from '../../../../public/img/templates/main-products/zavod.jpg'
    import Kottedzh from '../../../../public/img/templates/main-products/kottedzh.jpg'

    export default {
        name: "PortalProductsContent",

        data() {
            return {
                MainProductsBgSecond,
                solutions: [
                    {
                        id: 1,
                        title: 'ГОСУДАРСТВЕННЫЕ УЧРЕЖДЕНИЯ',
                        img: GosStruktury,
                        text: 'Установка информационных систем безопасности в рамках государственных регламентов с использованием сертифицированного оборудования и учетом специфики деятельности учреждения.',
                        details: 'Наши решения для муниципальной инфраструктуры любой сложности: <br>' +
                            '1. СКУД — домофоны, турникеты, шлагбаумы, электронные замки, ворота, калитки<br>' +
                            '2. Системы видеонаблюдения — проектирование, монтаж, техническое обслуживание<br>' +
                            '3. Удобные решения для «Безопасного Города» — организация вывода видеосигнала на пульт ЕДДС с муниципальных объектов, единая картографическая платформа, возможностью онлайн-просмотра, работой с видеоархивами и видеоаналитикой.<br>' +
                            '4. Разработка и монтаж:<br>' +
                            '• видеосистем с большим количеством территориально разделенных камер;<br>' +
                            '• информационных сетей; <br>' +
                            '• локальной телефонии (SIP) и телефонии через интернет.<br><br>' +
                            'Мы также занимаемся сервисным ТО видеосистем, серверного оборудования, компьютеров СКУД, шлагбаумов, а также оперативной техподдержкой для быстрого устранения неисправностей.'
                    },
                    {
                        id: 2,
                        title: 'ОБРАЗОВАТЕЛЬНЫЕ УЧРЕЖДЕНИЯ',
                        img: ObrazovatelnyeUchrezhdenia,
                        text: 'Полный комплекс автоматизированных систем охраны и контроля: спокойны родители, дети в безопасности.',
                        details: '• Системы видеонаблюдения — позволяют осуществлять 100% контроль за прилегающей территорией, коридорами, входными группами, общей дисциплиной и сохранностью имущества.<br>' +
                            '• Такие системы, как СКУД и «Цифровая школа» — оптимальный способ снизить количество прогулов и опозданий, улучшить посещаемость и качество знаний. <br><br>' +
                            'Теперь родители полностью уверены в безопасности детей, а школьный рейтинг за счет роста показателей взлетит вверх.<br><br>' +
                            'Мы занимаемся разработкой и монтажом информационных сетей, администрированием (в т.ч. и удаленным) и сервисным ТО видеосистем, серверного оборудования, компьютеров СКУД, шлагбаумов, а также оперативной техподдержкой для быстрого устранения неисправностей.'
                    },
                    {
                        id: 3,
                        title: 'ЖИЛЫЕ КОМПЛЕКСЫ',
                        img: ZhilyeKomplexy,
                        text: 'Продуманные до мелочей и функциональные системы безопасности жилых домов различной конфигурации. Современные цифровые технологии с минимальным «человеческим фактором»: Умный двор, Умный подъезд, Умный дом.',
                        details: '• Видеонаблюдение — для обеспечения безопасности подъездов, лифтов, придомовой территории, детских площадок, парковок и стоянок.<br>' +
                            '• Система видеоаналитики — понятный функционал с возможностью добавления опций: облачное хранение данных (гарантия их сохранности) и другое.<br>' +
                            '• Домофонные системы с определением лиц, связи с консьержем, удаленным открытием двери с телефона.<br>' +
                            '• Охранные системы — датчики движения, открытия дверей, контроль работы котлов, датчики подтопления и прочее.<br>' +
                            '• СКУД — шлагбаумы\\ворота для внутридомовой территории, калитки, удаленное управление со смартфона, а также дистанционное управление лифтом<br><br>' +
                            'Мы занимаемся разработкой и монтажом информационных сетей, администрированием (в т.ч. и удаленным) и сервисным ТО видеосистем, серверного оборудования, компьютеров СКУД, шлагбаумов, а также оперативной техподдержкой для быстрого устранения неисправностей.'
                    },
                    {
                        id: 4,
                        title: 'РОЗНИЧНАЯ ТОРГОВЛЯ',
                        img: RoznichnayaTorgovlya,
                        text: 'Понятные и функциональные системы безопасности, для обеспечения надежной защиты персонала, ценного имущества и оборудования, а также товаров. Возможность не только снизить риски краж и хищений, но и систематизировать аналитическую работу для решения задач маркетинга.',
                        details: '1. Системы видеонаблюдения — для предотвращения, выявления и расследование краж и противоправных действий, контроля соблюдения персоналом рабочих регламентов, выявления нарушений, мошенничества и краж на кассах.<br>' +
                            '2. Видео-аналитика для маркетингового анализа: тепловая карта — горячие, холодные зоны, вычисление постоянных покупателей, возрастных параметров покупателей, настроение покупателей на кассе.<br>' +
                            '3. Помощь в логистике — расчет заполнения полок магазина, цифровая тележка, график остатков на складе и на полках, количество мест для парковки и остаток времени, а также контроль зон выгрузки<br><br>' +
                            'Мы занимаемся разработкой и монтажом информационных сетей, администрированием (в т.ч. и удаленным) и сервисным ТО видеосистем, серверного оборудования, компьютеров СКУД, шлагбаумов, а также оперативной техподдержкой для быстрого устранения неисправностей.'
                    },
                    {
                        id: 5,
                        title: 'ТРАНСПОРТ И ЛОГИСТИКА',
                        img: TransportILogikistika,
                        text: 'Предлагаем комплексные решения для обеспечения мер безопасности на транспорте и пассажирских предприятиях. Теперь под контролем будет не только автопарк, но и объекты транспортной инфраструктуры.',
                        details: '• Организация WiFi в транспорте и внедрение автотранспорта в систему «Безопасный город»<br>' +
                            '• Отчетность о потреблении топлива, пройденном расстоянии, холостой работе двигателя, остановках, СКУД в автобусах, датчики ДТП.<br>' +
                            '• Видеонаблюдение — система непрерывной передачи данных диспетчеру на экран, автоматическая выгрузка данных при потере связи с интернетом и последующем возобновлением.<br><br>' +
                            'Мы занимаемся разработкой и монтажом информационных сетей, администрированием (в т.ч. и удаленным) и сервисным ТО видеосистем, серверного оборудования, компьютеров СКУД, шлагбаумов, а также оперативной техподдержкой для быстрого устранения неисправностей.'
                    },
                    {
                        id: 6,
                        title: 'ПРОИЗВОДСТВЕННЫЕ КОМПАНИИ',
                        img: Zavod,
                        text: 'Высококачественные сертифицированные системы промышленной связи и безопасности для объектов строительства и различных отраслей промышленности.',
                        details: 'Мы реализуем оборудование оперативно-диспетчерской и громкоговорящей связи, систем контроля, управления и оповещения, систем технологического и общего видеонаблюдения, сетевой инфраструктуры.<br>' +
                            '• Видеонаблюдение — для предотвращения, выявления и расследования краж и иных противоправных действий.<br>' +
                            '• Системы учет и контроля рабочего времени персонала и контроля за соблюдением персоналом рабочих регламентов<br>' +
                            '• СКУД — домофоны, турникеты, шлагбаумы, электронные замки, ворота, калитки.<br><br>' +
                            'Наши основные задачи — разработка и монтаж информационных сетей, администрирование (в т.ч. и удаленным) и сервисное ТО видеосистем, серверного оборудования, компьютеров СКУД, шлагбаумов, а также оперативная техподдержка для быстрого устранения неисправностей.'
                    },
                    {
                        id: 7,
                        title: 'ЧАСТНЫЕ ДОМОВЛАДЕНИЯ',
                        img: Kottedzh,
                        text: 'Продуманные до мелочей и функциональные системы безопасности жилых домов различной конфигурации. Современные цифровые технологии с минимальным «человеческим фактором»: Умный двор, Умный подъезд, Умный дом.',
                        details: '• Видеонаблюдение — для обеспечения безопасности подъездов, лифтов, придомовой территории, детских площадок, парковок и стоянок.<br>' +
                            '• Система видеоаналитики — понятный функционал с возможностью добавления опций: облачное хранение данных (гарантия их сохранности) и другое.<br>' +
                            '• Домофонные системы с определением лиц, связи с консьержем, удаленным открытием двери с телефона.<br>' +
                            '• Охранные системы — датчики движения, открытия дверей, контроль работы котлов, датчики подтопления и прочее.<br>' +
                            '• СКУД — шлагбаумы\\ворота для внутридомовой территории, калитки, удаленное управление со смартфона, а также дистанционное управление лифтом<br><br>' +
                            'Мы занимаемся разработкой и монтажом информационных сетей, администрированием (в т.ч. и удаленным) и сервисным ТО видеосистем, серверного оборудования, компьютеров СКУД, шлагбаумов, а также оперативной техподдержкой для быстрого устранения неисправностей.'
                    },
                ],
                detailsWindow: {id: 0, title: '', img: null, text: '', details: ''}
            }
        },

        methods: {
            wowClass(id) {
                if (id === 1) return 'wow'
            },

            showDetails(solution) {
                this.detailsWindow = solution
                $('#productDetails').modal('show')
            }
        },

        mounted() {
            $('#productDetails').modal({
                show: false
            })
            $(document).on('hidden.bs.modal', '#productDetails', function () {
                this.detailsWindow = {id: 0, title: '', img: null, text: '', details: ''}
            })
        }
    }
</script>

<style scoped>

</style>
