<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются во время аутентификации для
    | различных сообщений которые мы должны вывести пользователю на экран.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */

    'failed'   => 'Имя пользователя и пароль не совпадают.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте еще раз через :seconds сек.',
    'login' => 'Вход',
    'register' => 'Регистрация',
    'logout' => 'Выход',
    'name' => 'Имя пользователя',
    'email' => 'Электронный адрес',
    'password' => 'Пароль',
    'confirm' => 'Подтвердите пароль',
    'remember' => 'Запомнить',
    'forgot' => 'Забыли пароль?',
    'password_reset' => 'Сброс пароля',
    'password_reset_button' => 'Сбросить пароль',
    'send_link' => 'Отправить ссылку на сброс пароля',

];
